#include <iostream>
#include <cmath>
using namespace std;

// Завдання 1 (If37): 
// Для заданого дійсного x знайти значення функції q(x):
// q(x) = -2x, якщо x < 0
// q(x) = x^2 + 1, якщо 0 ≤ x ≤ 2
// q(x) = 5, якщо x > 2

void task_if37()
{
    cout << "Завдання 1 (If37)" << endl;
    double x;
    cout << "Введiть значення x: ";
    cin >> x;

    // Перевірка на коректність введення
    if (!cin) {
        cerr << "Помилка: введено нечислове значення!" << endl;
        return;
    }

    double q; // результат обчислення функції

    if (x < 0)
        q = -2 * x;
    else if (x <= 2)
        q = x * x + 1;
    else
        q = 5;

    cout << "Результат q(x) = " << q << endl;
}

// Завдання 2 (If15): 
// Дано три числа. Знайти суму двох найбiльших з них.

void task_if15()
{
    cout << "Завдання 2 (If15)" << endl;
    double a, b, c;
    cout << "Введiть три числа (a, b, c): ";
    cin >> a >> b >> c;

    if (!cin) {
        cerr << "Помилка: введено нечислове значення!" << endl;
        return;
    }

    double sum;
    // сума двох найбільших = (a + b + c) - мінімальне з трьох
    double min_val = a;
    if (b < min_val) min_val = b;
    if (c < min_val) min_val = c;

    sum = a + b + c - min_val;

    cout << "Сума двох найбiльших чисел = " << sum << endl;
}


// Завдання 3 (геометричне, 17 вар.)
// Перевірити, чи потрапляє точка (x, y) у заштриховану область

void task_geom()
{
    cout << "Завдання 3 (Геометричне)" << endl;

    double x, y, R;

    cout << "Введiть радiус кола R: ";
    cin >> R;

    cout << "Введiть координати точки (x, y): ";
    cin >> x >> y;

    if (!cin) {
        cerr << "Помилка: введено нечислове значення!" << endl;
        return;
    }

    // Квадрат відстані до точки (для перевірки кола)
    double distSq = x * x + y * y;
    double RSq = R * R;

    // 1. Нижня біла зона (3-тя чверть: x<0, y<0)
    // Ззовні кола (distSq >= RSq)
    // Всередині ромба. У 3-й чверті лінія проходить через (-2R, 0) та (0, -2R).
    // Рівняння: y = -x - 2R. Ми маємо бути вище цієї лінії (ближче до осей).
    // Тобто: y >= -x - 2*R
    bool zone1 = (x <= 0 && y <= 0 && 
                  (distSq >= RSq) &&       // ЗА межами кола
                  (y >= -x - 2 * R));      // Всередині ромба

    // 2. Верхня біла зона (2-га чверть: x<0, y>0)
    // Ззовні кола (distSq >= RSq)
    // Всередині ромба. У 2-й чверті лінія проходить через (-2R, 0) та (0, 2R).
    // Рівняння: y = x + 2R. Ми маємо бути нище цієї лінії.
    // Тобто: y <= x + 2*R
    bool zone2 = (x <= 0 && y >= 0 && 
                  (distSq >= RSq) &&       // ЗА межами кола
                  (y <= x + 2 * R));       // Всередині ромба

    if (zone1 || zone2) {
        cout << "Точка (" << x << ", " << y << ") ПОТРАПЛЯЄ в білу зону." << endl;
    } else {
        cout << "Точка (" << x << ", " << y << ") НЕ потрапляє в білу зону." << endl;
    }
}


// Головна функція програми (меню вибору завдань)
int main()
{
    int menu;
    cout << "Меню" << endl;
    cout << "1 - Завдання 1 (If37)" << endl;
    cout << "2 - Завдання 2 (If15)" << endl;
    cout << "3 - Завдання 3 (Геометрiя)" << endl;
    cout << "Оберiть номер завдання: ";
    cin >> menu;

    if (!cin) {
        cerr << "Помилка введення!" << endl;
        return 1;
    }

    switch (menu) {
        case 1: task_if37(); break;
        case 2: task_if15(); break;
        case 3: task_geom(); break;
        default:
            cout << "Помилка: доступнi лише завдання 1–3!" << endl;
            break;
    }

    system("pause");
    return 0;
}
